src/CF/Catalogs/АссортиментДляРабочегоМестаКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>АссортиментДляРабочегоМестаКассира</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияСОпределенногоСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияОтОпределеннойОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализоватьСИспользованиеОпределенногоВидаЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализоватьСПоступлениеДенегВОпределенноеХранилище</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопкиКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопкиЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопкиСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаКнопкиКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаКнопкиЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаКнопкиСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРазмеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВАРМСтраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВАРМКолонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВАРМСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Enums/ВидыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыРазмеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мелкий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Крупный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Огромный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/АссортиментДляРабочегоМестаКассира/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// sza140605-2335  
Процедура ОбновитьПримерКнопки()
	
	ЦветФона = Новый Цвет(Объект.ЦветФонаКнопкиКрасный, Объект.ЦветФонаКнопкиЗеленый, Объект.ЦветФонаКнопкиСиний);
	Элементы.ПримерКнопки.ЦветФона = ЦветФона;
	ЦветТекста = Новый Цвет(Объект.ЦветТекстаКнопкиКрасный, Объект.ЦветТекстаКнопкиЗеленый, Объект.ЦветТекстаКнопкиСиний);
	Элементы.ПримерКнопки.ЦветТекста = ЦветТекста;
	Если Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Крупный") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 16;
	ИначеЕсли Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Мелкий") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 8;
	ИначеЕсли Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Огромный") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 20;
	ИначеЕсли Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Средний") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 12;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
	ОбновитьПримерКнопки();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000365", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСложныйМеханизмЦен") 
				И НЕ ЗначениеЗаполнено(Объект.РеализоватьСИспользованиеОпределенногоВидаЦен) Тогда
				
				Объект.РеализоватьСИспользованиеОпределенногоВидаЦен = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВидЦенДляРеализацииНаРабочемМестеОператораКассы");
				Если НЕ ЗначениеЗаполнено(Объект.РеализоватьСИспользованиеОпределенногоВидаЦен) Тогда
					Объект.РеализоватьСИспользованиеОпределенногоВидаЦен = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВидЦенРасходованияПоУмолчанию");
				КонецЕсли;
			КонецЕсли;			
			
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам")
				И НЕ ЗначениеЗаполнено(Объект.РеализацияСОпределенногоСклада) Тогда
				
				Объект.РеализацияСОпределенногоСклада = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("СкладПоУмолчанию");				
			КонецЕсли;
			
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСобственныхЮридическихЛиц")
				И НЕ ЗначениеЗаполнено(Объект.РеализацияОтОпределеннойОрганизации) Тогда
				
				Объект.РеализацияОтОпределеннойОрганизации = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ОрганизацияПоУмолчанию");
			КонецЕсли;
			
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДенегВНесколькихХранилищах")
				И НЕ ЗначениеЗаполнено(Объект.РеализоватьСПоступлениеДенегВОпределенноеХранилище) Тогда
				
				Объект.РеализоватьСПоступлениеДенегВОпределенноеХранилище = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ХранилищеДенегДляРабочегоМестаОператораКассы");
				Если НЕ ЗначениеЗаполнено(Объект.РеализоватьСПоступлениеДенегВОпределенноеХранилище) Тогда
					Объект.РеализоватьСПоступлениеДенегВОпределенноеХранилище = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ОсновноеХранилищеДенег");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") Тогда
			Элементы.РеализоватьСИспользованиеОпределенногоВидаЦен.Доступность = ЛОЖЬ;	
		КонецЕсли;	
		
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, ИСТИНА);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерТекстаПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаКнопкиЗеленыйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаКнопкиКрасныйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаКнопкиСинийПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаКнопкиЗеленыйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаКнопкиКрасныйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаКнопкиСинийПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
КонецПроцедуры
